app/controllers/articles_controller.rb

  def create
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2022-06-23 08:53:50.358946"], ["updated_at", "2022-06-23 08:53:50.358946"]]

    def edit
        @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @article = Article.find(params[:id])
        @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2022-06-23 09:43:07.899106"], ["id", 1]]